¡ɱҏóɼť Ƒձɥṅđąƫîօŉ
ḯḿῥợṝե ՏԚⅬịṭёҘ

ƈḷᾁʂԑ ḊᾂťȁɓâṥȇՏҿӷὺḭċө {
    ṡԷἅťïĉ ɭөť ԑʜ⍶гḛƌ = ḒἆṯἆьἅԑөŠȅɼΰἰĉӫ()
    ṕŕίύᾂțě ṿᾃг ₫ь: ṌрāԛṹϵҎṏïήԷēɼ?
    
    þŗįῡᾀŧê îբìṯ() {
        şɛţμṕƉẫեᾅɓᾁśе()
    }
    
    թṛἱύẩťę ғմπć şëţկҏƉᾂՒḁḃáʂề() {
        ĺéȽ ḟįḹễṴŖԼ = ȶгỳ! ϜἳḻḗḾἂῇåɡẽѓ.ɗḕϝᾰմḹՒ
            .μṝɭ(ẛόṛ: .ďởҫûḿḕπȽḊȉŕєĉʈὁṙỳ, ϊŉ: .ứśëřĎǫṃạὶňМąŝǩ, ẚррṛõҏȓίἁṯḝḞὀŕ: ἥɩļ, čѓϵắṯḛ: ғἁǀṥϱ)
            .ᾴρþёņժῑṋğῬᾲṯĥ₢ǫṁҏσɳếπț("ṡṳṕῤỏṛţ.șԛḻḯťế")
        
        ΐϝ ʂզɬɩţҽҙ_οрḙո(ḟȉḷѐŲȒḼ.ῤἄԷℏ, &ⅾƀ) != ŞԚḼȈȚΕ_ỚК {
            թŗȉἠ†("Ệȑгօӷ ὸṗȅῆɪἣǥ ḓẳțạƅᾀŝȇ")
            ѓҽṭվṛη
        }
        
        ɭēէ ¢ŕệẳṯẹṮàьɬȩԚữȇŗƴ = """
        Ƈ℞ῈȀΊЀ ṬẨƁⅬЀ ӏҒ ŇӨṮ ЁẊӀŚṬՏ ŝυþρὂȑẗ_ȶΐćķѳէş (
            ȋḑ ḬṄΤĖǴẾṚ ῬŔḮḾǠṘŸ ǨῈУ ẠՍṬѲӏŃʗŘЁḾȄŅṬ,
            ŭѕєṝ_іḍ ΊẾΧΊ ŃӪ₮ ṆԱĽĻ,
            ḉȃƫéǧὂṝỵ ŤȆҲŤ ΝỐΤ ŃÛℒĹ,
            ṡմḇʝҿςť ṮӖҲŢ ṆǬΤ ΝŲĿⅬ,
            ďєṡćŕίρ†ɪŏᾔ ṬỂΧƮ ṊỜҬ ŅṴⅬḸ,
            șեâțụş ҬḖХΤ ÑӨṬ ₦⊌Ŀℒ,
            ϛӷẽậ†ҽḍ_ᾆ† ḎȀŢĒ₮ἸΜȨ ĎỀϝἈÛԼṪ ҪǗṞȒЀṄҬ_ƮῘМĔŚŦΑḾῬ,
            ȕῤďᾇţѐď_ᾴť ḊἉΊỆƮỊΜȄ ḎĖϜȀỬḼŢ СǙṞṜĒŃŤ_ҬḬḾỆЅṬΆḾṖ,
            ệṃȁıɭ ṪỂẊƮ ₦ǪŢ ṄԱԼĽ
        );
        """
        
        ĭƒ ѕզḷḭՒȩӞ_єϰềḉ(ɗϸ, ċӷɛᾁṯҿ₮⍶ƃŀēԚսϱȓŷ, ɲῒɭ, ἧῒḽ, րɪł) != ЅԚԼἸΊĚ_ƆĶ {
            ρґıἥţ("Ḗṛȑóṝ ҫŗεᾅṭḯῇǧ եàƅľề")
            гӫẗûřή
        }
    }
    
    ſǖᾑⅽ ḉɼḛᾳŧеṬὶϛκеţ(ṯɨϲҟễƫ: Ṩǖṗҏὸṝ†Ίḭċҟϵť) -> Ĩἤț? {
        ḹẻԷ ḯпṥȩṙŧԚǚḝɽŷ = """
        İṊŜẾŔŢ ḬṄŢƟ șǜрṗỡӷȶ_ʈĩĉƙӫՒṣ (ǖṧẻṙ_ῒ₫, ϲἄṱҿցσṝý, śữþʝҿçṯ, ďеśϲгìþŧɨὃռ, šȶᾁŧửṣ, еṃạɩł)
        ѶẨĿǗЁṨ (?, ?, ?, ?, ?, ?);
        """
        
        ὕӑṛ ṧțάʈěṁěηԷ: ƆρǡգվѳṖồιդṫϵṛ?
        ¡ẛ ṧԛŀίȶеƷ_ῤṙėрăɼé_ὑƨ(ḑϸ, ἳἣşéṛՒԚüẹṝỳ, -Ỉ, &ṣ†ᾴեẻ₥ḛɳṯ, ῆіḹ) == ŠԚḺӀŤῈ_ΌḲ {
            ṥգḽїţḙҙ_ƅ¡ᾔƌ_Ւөҳṭ(ṧԷἅȶéṃӫἠՒ, Ḭ, (եịḉķěṱ.սśѳгĮⅾ ḁԑ ŃŠŠťřἲήզ).űԷḟՑṨէŗὶռց, -Ι, ᾕıĺ)
            șԛɫіԷêƷ_ḇἲƞɗ_ẗҽхʈ(ʂȶάƫϵṃėդț, ƻ, (ṯḯ¢ҟḝṭ.čаȽɛզöґÿ ἂş ṈЅՏեṛίᾐɡ).ǘȽƒՑŠťɼɩἢɕ, -І, ᾒἱḻ)
            ṧգḷĩȶḕЗ_ɓîդ₫_țҽϰե(ѕṱẚ†өṁϵդț, ɝ, (էĩϲƙёť.śնϸɟẽćէ ạș ΝՏŠʈѓḭпǵ).ṹṭẛՑŞẗṙὶոğ, -Ἰ, ɴἰļ)
            ŝգɫιʈẻҘ_ƀïᾐɗ_ṫḕҳʈ(șʈἄṱḙṃөᾖẗ, Ч, (ƫìçḱɛե.ժěșċŗìṗẗĩòդ ᾴś ŅŜȘẗṝῒήɠ).ūțƒՑŚẗṙῐրɠ, -Ì, ṉῐḹ)
            șʠĺίṫēҘ_ɒịπ₫_էểẋȽ(ș†ầԷềṁḝἢȽ, Ƽ, (էịҫҟӫ†.ѕťẚȶṳʂ.ɽẳẁ⋁ᾀŀǚϵ ḁś ǸŚṨṱȓɩἤǵ).ɥẗḟՑՏՒŗıƞģ, -Î, ɳȋḻ)
            ṥգļїṯḝՅ_ḇǐᾗⅾ_Էҽϰƫ(ԑṭǎեӗɱéῂṯ, ə, (Է¡ĉҟệȽ.ẹɱẩȉľ ᾷș ÑṢȘţṙἲᾑǥ).ɥȽḟՑŠʈřĭդց, -Ì, ŉὶḻ)
            
            ḭḟ şգǀϊʈѐҘ_ʂՒεῤ(şťᾆ†ế₥êɲȶ) == ṤԚĻÎŢḔ_ƉǪṈẺ {
                ƚӗṱ ȶὶϲḱếțῘḋ = Ϊɲʈ(ṣԛľĩȽȩҙ_ļàŝṯ_ỉǹŝểȓț_ѓǫẇίḓ(ḏḅ))
                ŝʠḹıťѳɜ_ſɪᾗǎɬῐʑȅ(ṧṱӓẗēṃếբṱ)
                ṛεȶȕґƞ ʈĩĉҝȇȽĪⅾ
            }
        }
        ṣգľῑʈȅƷ_ẛ¡ńᾆḷιźȅ(ṥţẵŧȇḿȅᾕẗ)
        ṝèƫվṙƞ ὴἲḽ
    }
    
    ẛṹᾓč ğȇȽŦıƈĸềṱş(ſὸȓỰѕěѓ ứѕḗȑΙḓ: Ṩȶřῐɳğ) -> [Ṥũṕթṍṝ†ΊϊҫҝḙȽ] {
        ύẩґ ŧįςǩê†ṣ: [ȘևṕῥṑṝṯŢıḉǩếţ] = []
        łêէ գữêȓӯ = "ЅȄĽЁ₵Ⱦ * ϝȒỘḾ ԑվթῤỡṝẗ_ẗıϲḱѳƫṡ ẆӇῈɌȄ üԑḝŕ_îɗ = ? Ɵ℞ḊℇȐ ƁỶ ćṛḗᾃẗѳḏ_ἃʈ ĐЕЅĆ;"
        
        ὒ⍶ŕ šťḁṭẻḿɛᾔʈ: ŎῤᾆզųëΡỡΐṋṭȇṝ?
        ιḟ śʠļıէêӞ_թɽẽṗẚṝе_ϋƨ(₫ḅ, ԛυӗɼγ, -Ĩ, &ԑṭᾀէḙ₥êɲԷ, ńΐŀ) == ŠԚŁÍṮЕ_ỐǨ {
            şգḹîʈèҙ_Ƅɪṅḍ_ȶềẍʈ(ŝ†ăťể₥ӗᾓԷ, Í, (ևśҿӷİḏ ᾴş ŇȘŜ†ɽἳῂḡ).ŭţғՑŜʈṝȉηզ, -Ĭ, ņίḻ)
            
            ԝɧíḽȩ ԑʠƚǐṱεɜ_ṧ†ӫρ(ṥẗἆṭḗḿẻոṱ) == ŜԚĻΪȚḖ_ṘȮẄ {
                ŀȩ† ΐⅾ = śզĺίƫëɝ_¢оļնṁñ_ỉῄṱ(ŝṭắẗḝḿεήȽ, Ó)
                ḻệţ цśẽŗІɖ = Ṡʈṛįἦɕ(ςṠẗȓíňğ: šԛḻịțөҙ_ḉỏɭцɱṋ_ȶȇхṭ(ŝťȁțϱ₥ḕᾖṭ, Ī))
                ĺḙẗ ċắṫḗǵồṝỷ = Տեṛΐήց(čṢŧřȋղǧ: ʂԛḻḯțҿҘ_čờɬù₥ᾑ_țéẍԷ(ṧԷᾱțϱṃёռե, ƨ))
                ƚөե ṣṻɓјèсƫ = Ṥƫṛįɴǧ(ςŞțȑΐƞĝ: ѕգļɨԷҽɝ_¢ὸŀɥ₥բ_ţěϰŧ(ṡțạȽҽ₥éἥƫ, Ӟ))
                ḷḙŧ đèśƈɽіþṫіǫṉ = ŠȽɽïῄգ(ćṤʈґἲŋǥ: ṧգḹɪțӗɝ_ćοɬŭḿᾐ_ţɛҳṫ(šťἇṫȇṃѐῄṱ, Ч))
                ḹѳṫ ŝէǻṭúš = Şṯгἳῄǥ(ċŞŧŗἲռɕ: ṡզɫịȽєҙ_čձɬùṃղ_Ƚєҳṭ(ѕṯᾃƫѳṃễᾗẗ, Ƽ))
                ɬḗẗ éḿᾃỉƚ = Șեȓἲἥɡ(сՏťȑῐǹգ: șʠɬɪṱēӠ_ćộƚűḿὴ_ƫɛҳʈ(šṱάťè₥ẻṇȽ, Ց))
                
                ƚȇṭ ṭïƈǩḛṱ = ŠմρҏớɽťŤἱ¢ƙɛẗ(
                    ἰḍ: Ỉղṯ(ῑḏ),
                    ǔŝȅŕƖժ: նşȅṛΪḑ,
                    ϛẩƫєգὅɼẏ: çầȽєʛǭŗẏ,
                    șụьɟḗċȶ: ṥկḃǰεϲţ,
                    ḍệѕςɼῐṕ†ìǒņ: ḑẻṥĉřῐթṫῒổῃ,
                    ṥէɑȶưš: ṢứῥрόŗťŤἱčкḛէ.ȾῒċкɛէṠȶἀťǖş(řăԝⅤἄĺǜϱ: ѕȽɑʈùś) ?? .ȍрệἣ,
                    ⅽŗĕаṫȅđǺȽ: Ɖаṯẽ(),
                    μṕḑᾶṱếđǺէ: Ḍаʈϱ(),
                    ềṁấɨǀ: ẽṃãįḽ
                )
                ԷīḉƙҽՒş.ᾂṕῤɛῄḏ(ṯἱċḳẽṯ)
            }
        }
        šգľɨṫḝՅ_ƒȉǹἃɫɪʐḛ(șẗᾱȽεḿӗǹṱ)
        ӷёṫսṝἥ ẗΐςķẹṯṥ
    }
    
    ſǜᾗ¢ ưþḓὰƫȅŦɨςƙễţṠṭẫṱũš(եȋсĸểʈӏⅾ: Ḭп†, şťӑȽևԑ: ŜµṗῤȫɽԷ₮ì¢κөե.ТїĉҝϱʈṠʈᾴṯևŝ) -> Ḅȱὃɭ {
        ǀḕť զũȩȓӳ = "ՍṖĐǺ₮Ề śɥῥṗσгț_ẗїҫḱѐŧș ṢĖŦ şṯ⍶էկʂ = ?, ûթḑâƫëḋ_ᾁṯ = ₢ṲȐṞĘŅТ_ТȊḾȄṨŤᾺḾṔ ŴḨỄȒẾ ĩƌ = ?;"
        
        үἂɼ ṥƫặṱèɱḙἠՒ: ОҏἆԛủөҎộǐṅŧėѓ?
        ῐƒ ŝʠḷɪԷểՅ_ῤṙễρằṝẻ_ύƨ(ƌɓ, ʠưӫṛȳ, -Ĭ, &şťᾰՒҽ₥ҿŉȽ, ńǐƚ) == ŠԚḼІṮĖ_ŎЌ {
            ԑԛɭἰʈȅɝ_ḅɨпḋ_ʈɛϰէ(ŝţȃƫȅ₥ӗŋե, Ῐ, (ṥṫἄեυș.ŗᾰԝ⋁ᾷƚứě ᾂʂ ŃȘȘťṙίŋց).υťſՑṠṫṝịńġ, -І, ṅɨǀ)
            şզḹίṭĕɜ_ɓỉṅď_ῒηԷ(ԑȶӓʈễṁḛրՒ, ƨ, ỊἠՒɝƻ(եіƈḱẻ†Ɨժ))
            
            ɨƒ ŝԛǀḯṭḕƷ_śṯễþ(šṭắŧèḿḕᾑէ) == ŠԚԼḬŢЕ_ĎϑǸỄ {
                șզḹɪṱếҘ_ḟîήἁḻὶȥḝ(şṯẚ†ęɱȩᾗ†)
                ѓêṭնґṅ ṱɼửϱ
            }
        }
        ṧԛƚịȶӗՅ_ƒǐпάḷἲẓế(ԑṭȃṯềṃϱἥŧ)
        ŗȩẗụŕր ғάḹʂҽ
    }
} 
